CoreJava/src/com/me/xsl/resources/oms_store21/INT29CRequest.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices">
   <soapenv:Header/>
   <soapenv:Body>
      <web:preConfirmOrder soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <StoreID xsi:type="xsd:string">123</StoreID>
         <orderID xsi:type="xsd:double">321</orderID>
      </web:preConfirmOrder>
   </soapenv:Body>
</soapenv:Envelope>